---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMap.ReverseIterator
source: html/69ed6e9c-1ece-49b9-5cd2-5b68b3f72aed.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.ReverseIterator Method

Retrieve a backward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual DefinitionBindingMapIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the map.